Repository: Humaneyew/DataG
Catalog: lib/l10n/app_*.arb
Languages: ru

# appTitle
source: DataG Trivia
ru: DataG Викторина

# homeTitle
source: DataG Trivia
ru: DataG Викторина

# homeWeeklyChallengeTitle
source: Week X
ru: Неделя X

# homeStubEventTitle
source: Event
ru: Событие

# homeStubFriendsTitle
source: Friends
ru: Друзья

# homePlayWithFriends
source: Play with friends
ru: Играй с друзьями

# homePlayButton
source: Play
ru: Играть

# homeChangeCategory
source: Change category
ru: Сменить категорию

# categoriesTitle
source: Categories
ru: Категории

# categoriesBack
source: Back
ru: Назад

# categoriesEmpty
source: No categories available yet.
ru: Категории пока недоступны.

# roundDetailsComingSoon
source: Details screen will arrive later.
ru: Экран с подробностями появится позже.

# roundTitleFallback
source: Round
ru: Раунд

# roundNoQuestions
source: No questions are available for this category.
ru: Нет доступных вопросов для этой категории.

# roundHintLast
source: Last digits (-{cost})
ru: Последние цифры (-{cost})

# roundHintNarrow
source: Narrow (-{cost})
ru: Сузить (-{cost})

# roundLastDigitsHint
source: Ends with {digits}
ru: Оканчивается на {digits}

# roundSubmit
source: Check answer
ru: Проверить ответ

# resultPerfect
source: Exact hit!
ru: Точный ответ!

# resultMissedBy
source: You missed by {delta, plural, one {# year} other {# years}}
ru: Промах на {delta, plural, one {# год} few {# года} many {# лет} other {# лет}}

# resultBaseScore
source: Base score: {value}
ru: Базовые очки: {value}

# resultBonus
source: Bonus: {value}
ru: Бонусы: {value}

# resultHintPenalty
source: Hint penalty: -{value}
ru: Штраф за подсказки: -{value}

# resultQuestionPoints
source: Question points: {value}
ru: Очки за вопрос: {value}

# resultNoHints
source: No hints used
ru: Без подсказок

# resultHintsPrefix
source: Hints: {list}
ru: Подсказки: {list}

# resultStreak
source: Streak {count}: 1.5× boost!
ru: Серия {count}: множитель 1,5×!

# resultYourAnswer
source: Your answer: {year} {era}
ru: Твой ответ: {year} {era}

# resultCorrectAnswer
source: Correct answer: {year} {era}
ru: Правильный ответ: {year} {era}

# resultNext
source: Next
ru: Дальше

# resultFinish
source: Finish
ru: Завершить

# resultDetails
source: Details
ru: Подробнее

# hintLabelLastDigits
source: Last digits
ru: Последние цифры

# hintLabelNarrow
source: Narrow
ru: Сузить

# summaryTitle
source: Summary
ru: Итоги

# summaryHeader
source: Round complete!
ru: Раунд завершён!

# summaryPoints
source: {value} points
ru: {value} очков

# summaryAccuracy
source: Hits ≤5 years: {value}
ru: Попадания ≤5 лет: {value}

# summaryAccuracyValue
source: {hits} of {total}
ru: {hits} из {total}

# summaryAverageDelta
source: Average delta: {value}
ru: Средняя дельта: {value}

# summaryBestStreak
source: Best streak: {value}
ru: Лучшая серия: {value}

# summaryPlayAgain
source: Play again
ru: Играть снова

# summaryHome
source: Home
ru: Домой

# stubComingSoon
source: {title} screen coming soon
ru: Экран «{title}» появится позже

# localeEnglish
source: English
ru: Английский

# localeUkrainian
source: Ukrainian
ru: Украинский

# localeRussian
source: Russian
ru: Русский

# localeMenuTooltip
source: Change language
ru: Сменить язык
