Repository: Humaneyew/DataG
Catalog: l10n/app_*.arb
Languages: ru, uk

# appTitle
source: Date Guesser
ru: Угадай дату
uk: DataG Вікторина

# homeTitle
source: Home
ru: Главная
uk: DataG Вікторина

# homeWeeklyChallengeTitle
source: Weekly challenge
ru: Еженедельный челлендж
uk: Тиждень X

# homeStubEventTitle
source: Weekly challenge
ru: Еженедельный челлендж
uk: Подія

# homeStubFriendsTitle
source: Play with friends
ru: Играть с друзьями
uk: Друзі

# homePlayWithFriends
source: Play with friends
ru: Играть с друзьями
uk: Грай з друзями

# homePlayButton
source: Start round
ru: Начать раунд
uk: Грати

# homeChangeCategory
source: Choose category
ru: Выбрать категорию
uk: Змінити категорію

# categoriesTitle
source: Categories
ru: Категории
uk: Категорії

# categoriesBack
source: Back to home
ru: Назад на главную
uk: Назад

# categoriesEmpty
source: No categories yet.
ru: Категории пока не доступны.
uk: Категорії поки недоступні.

# roundDetailsComingSoon
source: Detailed breakdown coming soon.
ru: Подробная статистика появится позже.
uk: Екран з подробицями з'явиться пізніше.

# roundTitleFallback
source: Timeline Trivia
ru: Раунд викторины
uk: Раунд

# roundNoQuestions
source: No questions available.
ru: Вопросов пока нет.
uk: Немає доступних запитань для цієї категорії.

# roundHintLast
source: Last digits (-{cost})
ru: Последние цифры (-{cost})
uk: Останні цифри (-{cost})

# roundHintAB
source: 50/50 (-{cost})
uk: A/B (-{cost})

# roundHintNarrow
source: Narrow timeline (-{cost})
ru: Узкий диапазон (-{cost})
uk: Звузити (-{cost})

# roundLastDigitsHint
source: Ends with: {digits}
ru: Заканчивается на: {digits}
uk: Закінчується на {digits}

# roundSubmit
source: Submit answer
ru: Ответить
uk: Перевірити відповідь

# resultPerfect
source: Perfect! You nailed it.
ru: Идеально! Вы попали точно.
uk: Точне влучання!

# resultMissedBy
source: Missed by {delta} years.
ru: Промах на {delta} лет.
uk: Похибка {delta, plural, one {# рік} few {# роки} many {# років} other {# років}}

# resultBaseScore
source: Base score: {score}
ru: Базовые очки: {score}
uk: Базові очки: {score}

# resultBonus
source: Bonus: {value}
ru: Бонус: {value}
uk: Бонуси: {bonus}

# resultHintPenalty
source: Hint penalty: -{penalty}
ru: Штраф за подсказки: -{penalty}
uk: Штраф за підказки: -{value}

# resultQuestionPoints
source: Question points: {points}
ru: Очки за вопрос: {points}
uk: Очки за запитання: {points}

# resultNoHints
source: No hints used.
ru: Подсказки не использовались.
uk: Без підказок

# resultHintsPrefix
source: Hints used: {hints}
ru: Использованы подсказки: {hints}
uk: Підказки: {hints}

# resultStreak
source: Streak bonus! {streak} in a row.
ru: Серия! {streak} подряд.
uk: Серія {streak}: множник 1,5×!

# resultYourAnswer
source: Your answer: {year} ({era})
ru: Ваш ответ: {year} ({era})
uk: Твоя відповідь: {year} {era}

# resultCorrectAnswer
source: Correct answer: {year} ({era})
ru: Правильный ответ: {year} ({era})
uk: Правильна відповідь: {year} {era}

# resultNext
source: Next question
ru: Следующий вопрос
uk: Далі

# resultFinish
source: Finish round
ru: Завершить раунд
uk: Завершити

# resultDetails
source: View details
ru: Подробнее
uk: Докладніше

# hintLabelLastDigits
source: Last digits
ru: Последние цифры
uk: Останні цифри

# hintLabelNarrow
source: Narrow timeline
ru: Узкий диапазон
uk: Звузити

# summaryTitle
source: Summary
ru: Итоги
uk: Підсумки

# summaryHeader
source: Round complete!
ru: Раунд завершён!
uk: Раунд завершено!

# summaryPoints
source: {score} pts
ru: {score} очков
uk: {points} очок

# summaryAccuracy
source: Accuracy: {accuracy}
ru: Точность: {accuracy}
uk: Влучання ≤5 років: {value}

# summaryAccuracyValue
source: {closeHits} of {totalQuestions} close hits
ru: {closeHits} из {totalQuestions} точных попаданий
uk: {hits} з {total}

# summaryAverageDelta
source: Average miss: {delta}
ru: Средний промах: {delta}
uk: Середня похибка: {value}

# summaryBestStreak
source: Best streak: {streak}
ru: Лучшая серия: {streak}
uk: Найкраща серія: {streak}

# summaryPlayAgain
source: Play again
ru: Сыграть ещё
uk: Грати ще

# summaryHome
source: Back to home
ru: На главную
uk: Додому

# stubComingSoon
source: "{feature}" is coming soon.
ru: "{feature}" скоро появится.
uk: Екран «{title}» з'явиться пізніше

# stubSoundToggle
source: Sound effects
ru: Звуковые эффекты
uk: Звукові ефекти

# stubHapticsToggle
source: Haptic feedback
ru: Виброотклик
uk: Вібровідгук

# localeEnglish
source: English
ru: Английский
uk: Англійська

# localeUkrainian
source: Ukrainian
ru: Украинский
uk: Українська

# localeRussian
source: Russian
ru: Русский
uk: Російська

# localeMenuTooltip
source: Change language
ru: Изменить язык
uk: Змінити мову
